Autodesk.Navisworks.Api.SelectionSource
Represents a reference to a source that can generate a selection on demand. Immutable.

Autodesk.Navisworks.Api.SelectionSource.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.SelectionSource.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.SelectionSource.GetRoot
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SelectionSource.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.SelectionSource.ToString
Returns a  that represents the current .
Returns: A  that represents the current .

Autodesk.Navisworks.Api.SelectionSource.TryGetSearch(Autodesk.Navisworks.Api.Document)
Returns a Autodesk.Navisworks.Api.Search that will generate the selected items specified by the selection source
Returns:
null if source could not be resolved or source does not represent selection as a Search

Autodesk.Navisworks.Api.SelectionSource.TryGetSelectedItems(Autodesk.Navisworks.Api.Document)
Returns a Autodesk.Navisworks.Api.ModelItemCollection that represents the selected items specified by the selection source
Returns:
null if source could not be resolved